tutorials/incompressible/simpleSolver/ACCM_bump2D/system/decomposeParDict
/*-------------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/

FoamFile
{
    version     		2.0;
    format      		ascii;
    class       		dictionary;
    object      		decomposeParDict;
}
//--------------------------------------------------------------------------------

numberOfSubdomains 		8;

method          		simple;

simpleCoeffs
{
	n			(8 1 1);
	delta 			0.001;
}

distributed     		no;

roots
(
);
